[
  {
	"name": "J.D.",
	"tag": "doctor",
	"age": 42,
	"occupation": "Ship's Doctor",
	"description": "A skilled physician, married to Sabrina and father of Kevin. Will keep the crew healthy.",
	"dialogues": ["I'm not too worried to be honest with you, as a doctor I know my worth", "This captain better know what he's doing! At least I can see in his eyes he values a true doctor", "Don't look at me, did you not hear me. I'M A DOCTOR. Go kill one of these other people, I don't care!", "what? You want me to break down and cry now that I've lost someone of my family? Its kill or be killed!"],
	"sprite": "res://assets/sprites/Doctor.png",
	"x": 0.45,
	"y": 0.3
  },
  {
	"name": "Sabrina",
	"tag": "mom",
	"age": 39,
	"occupation": "Carpenter",
	"description": "Married to the J.D., mother of Kevin. She also happens to be a very good carpenter",
	"dialogues": ["Oh how I wish my child would stay safe in these terrifying times!", "Please, please, please! Just kill me, save my child!", "This captain better not even DARE think to kill my child!"],
	"sprite": "res://assets/sprites/Carpenter.png",
	"x": 0.825,
	"y": 0.5
  },
  {
	"name": "Kevin",
	"tag": "child",
	"age": 10,
	"occupation": "Primary school",
	"description": "Often times left home alone. Son of the Doctor and Sabrina. Innocent, but who would kill a child anyways.",
	"dialogues": ["Mommy, I'm scared!", "*cries*", "I WANT TO GO HOME"],
	"sprite": "res://assets/sprites/Child.png",
	"x": 0.775,
	"y": 0.625
  },
  {
	"name": "Fast",
	"tag": "fast",
	"age": 25,
	"occupation": "Oarsman",
	"description": "One of two rowing brothers. Strong and loyal, keeps eyeing Ivana Kiss.",
	"dialogues": ["*stares at the pretty woman* Huh what? Sorry I'm a bit distracted", "I think she likes me back", "This captain is making some odd choices. He better not kill my lady!", "Don't talk to me, the sooner this hell is over the better."],
	"sprite": "res://assets/sprites/Rower1.png",
	"x": 0.1,
	"y": 0.575
  },
  {
	"name": "Furious",
	"tag": "furious",
	"age": 23,
	"occupation": "First Mate",
	"description": "Younger of the two brothers and First Mate of the ship. Keeps looking at Ivana Kiss",
	"dialogues": ["Have you met my brother? Some say we're two peas in a pod", "Ugh, Its hard to keep ahead of this darned Kraken! Luckily I have some pleasent company", "This is going horribly, as a first mate, maybe its my job to do something about it", "Losing a brother is like losing an arm..."],
	"sprite": "res://assets/sprites/Rower2.png",
	"x": 0.925,
	"y": 0.575
  },
  {
	"name": "The Onceler",
	"tag": "rich",
	"age": 50,
	"occupation": "Wealthy Merchant",
	"description": "A cunning rich passenger with millions and millions of gold. Obtained from a lucrative forestry business, not the most ethical work, but how bad could he possibly be.",
	"dialogues": ["What a trip from hell! The captain better know my worth!", "This captain is making some odd choices. I better ensure that I stay on by promising him a million gold.", "HELLOO! I AM RICH! IF YOU KEEP ME ALIVE I'LL MAKE YOU RICH."],
	"sprite": "res://assets/sprites/Rich.png",
	"x": 0.35,
	"y": 0.56
  },
  {
	"name": "Ivana Kiss",
	"tag": "prettywoman",
	"age": 22,
	"occupation": "Passenger",
	"description": "The most beautiful woman you have ever seen, tho she seems to have her eyes on the brothers.",
	"dialogues": ["Oh, how I so hope to make it home safe", "Thank god that strong rower is here to keep us safe.", "I would be so scared, but with the first mate looking out for me, be warned."],
	"sprite": "res://assets/sprites/Prettywoman.png",
	"x": 0.6,
	"y": 0.275
  },
  {
	"name": "Remy",
	"tag": "cook",
	"age": 45,
	"occupation": "Ship's Cook",
	"description": "Keeps the crew fed and spirits lifted. Brought his dog. Something appears to be moving beneath his hat",
	"dialogues": ["Who's a good boy? Don't worry doggo, it will all be okay", "Oh what terror! Don't look at my dog like that, he hasn't done anything wrong!", "If anything happens to my dog I will kill everyone on this boat and then myself."],
	"sprite": "res://assets/sprites/Chef.png",
	"x": 0.675,
	"y": 0.325
  },
  {
	"name": "Bill Steadysword",
	"tag": "poet",
	"age": 28,
	"occupation": "Writer",
	"description": "A dreamer and storyteller, likes buff men. Provides entertainment to the crew and wealthy passengers",
	"dialogues": ["Fair is Foul and Foul is Fair!", "Kraken, Kraken where art thou!", "You egg! This captain is Hamlet himself! Poisoned by ambitions!"],
	"sprite": "res://assets/sprites/Poet.png",
	"x": 0.3,
	"y": 0.28
  },
  {
	"name": "Father Lover",
	"tag": "priest",
	"age": 55,
	"occupation": "Priest",
	"description": "Albert Lover went into the clergy and became a priest, this left him with a rather unfortunate name. He is the spiritual guide of the crew.",
	"dialogues": ["Let us pray for the quick disappearance of this devilish monster", "God, please stand by us!", "What has possessed this captain to make these terrible choices! He may be tempted by the devil himself!"],
	"sprite": "res://assets/sprites/Priest.png",
	"x": 0.2,
	"y": 0.4
  },
  {
	"name": "Jack",
	"tag": "jack",
	"age": 30,
	"occupation": "Scientist",
	"description": "A man of science always playing around with new formulas. His last experiment splashed his eye but I'm sure this is not a problem ",
	"dialogues": ["Hey, I'm Jack, top of the morning to ya", "I'm a man of science, I'm doing important research, please leave me alone", "It's clear this captain is not a scholar because there is ZERO logic in this decisions"],
	"sprite": "res://assets/sprites/Jack.png",
	"x": 0.6,
	"y": 0.55
  },

  {
	"name": "Dog",
	"tag": "dog",
	"age": 6,
	"occupation": "Good boy",
	"description": "He is a really good boy and loves his owner the chef",
	"dialogues": ["woof", "woof woof", "*growl*"],
	"sprite": "res://assets/sprites/Dog.png",
	"x": 0.725,
	"y": 0.45
  },
  {
	"name": "Stowaway",
	"tag": "stowaway",
	"age": 24,
	"occupation": "",
	"description": "A hidden passenger who boarded illegally. Nobody knows his name but he looks like a snake to me!",
	"dialogues": ["...", "If I don't move maybe he won't see me", "CRATE. I am a crate. Look away please! I just want to make it to shore, I didn't have any money for a ticket. "],
	"sprite": "res://assets/sprites/stowaway.png",
	"x": 0.52,
	"y": 0.3
  }
]
