[
  {
	"triggered": false,
	"condition": "priest and not child",
	"trigger_round": -1,
	"state_change": 1,
	"round_change": 0,
	"description": "Unsuprisingsly, the priest loses some faith in you because you killed a child. "
  },
  {
	"triggered": false,
	"condition": "rich and stowaway and not fast or rich and stowaway and not furious or rich and stowaway and not doctor",
	"trigger_round": -1,
	"state_change": 1,
	"round_change": 0,
	"description": "Really? Did you not see those moving eyes in the crate?"
  },

  {
	"triggered": false,
	"condition": "rich and dog and not fast or rich and dog and not furious or rich and dog and not doctor",
	"trigger_round": -1,
	"state_change": 1,
	"round_change": 0,
	"description": "Really? Of all people you could choose, you choose them? How can your richest travellers now believe you make competent choices."
  },

  {
	"triggered": false,
	"condition": "child and not mom",
	"trigger_round": -1,
	"state_change": 1,
	"round_change": 0,
	"description": "People can't believe you killed a child's mother, you really can't do anything right can you?"
  },
  {
	"triggered": false,
	"condition": "not furious",
	"trigger_round": -1,
	"state_change": 0,
	"round_change": 2,
	"description": "Pff with your strongest rower down you're really not going as fast as you did before"
  },
  {
	"triggered": false,
	"condition": "not fast",
	"trigger_round": -1,
	"state_change": 0,
	"round_change": 1,
	"description": "Okay he may not be your fasters rower, but losing a rower will still put a serious damp in your speed"
  },
  {
	"triggered": false,
	"condition": "furious and not fast",
	"trigger_round": -1,
	"state_change": 1,
	"round_change": 0,
	"description": "How dare you kill my brother! Yikes, there's nothing more unsettling that being on a tiny boat with a really buff really angry dude. Except the Kraken following you maybe."
  },
  {
	"triggered": false,
	"condition": "furious and not prettywoman or fast and not prettywoman" ,
	"trigger_round": -1,
	"state_change": 1,
	"round_change": -1,
	"description": "Did you not see that Rower eyeing up the Pretty Woman over there? He's very unhappy with you. Oddly, it does seem like the boat's going a bit faster without the distraction"
  },
  {
	"triggered": false,
	"condition": "child or dog",
	"trigger_round": 5,
	"state_change": -1,
	"round_change": 0,
	"description": "There's something so heartwarming about having a little cutie on board. The travellers are calming down a bit"
  },
  {
	"triggered": false,
	"condition": "not doctor",
	"trigger_round": -1,
	"state_change": 1,
	"round_change": 0,
	"description": "These travellers are really unhappy that of all people, you killed the doctor?!"
  }
]
